# 2.Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с
# суммой двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с
# такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.

a = int(input('Введите длинну первой стороны треугольника '))
b = int(input('Введите длинну второй стороны треугольника '))
c = int(input('Введите длинну третьей стороны треугольника '))

if a < b + c and b < a + c and c < a + b:
    if a == b == c:
        print('Треугольник ялвляется равносторонним')
    elif a == b or a == c or b == c:
        print('Треугольник является равнобедренным')
    else:
        print('Треугольник разносторонний')
else:
    print('Такой треугольник не существует')
